load-tests/job-autofill.yml
config:
  target: "https://<PROJECT_REF>.supabase.co"
  phases:
    - duration: 60 # seconds
      arrivalRate: 5 # new virtual users per second
  defaults:
    headers:
      Content-Type: application/json

scenarios:
  - name: Job autofill smoke
    flow:
      - post:
          url: "/functions/v1/job-url-autofill"
          json:
            url: "https://www.example.com/job/example"

# NOTE: Replace <PROJECT_REF> in `target` with your Supabase project host (e.g. https://abc123.supabase.co)
# Run locally: `npx artillery run load-tests/job-autofill.yml`